[
  {
    "name": "张浩",
    "name_eng": "Zhang Hao",
    "baseMood": 46,
    "personalityType": "中性",
    "personalityType_eng": "neutral",
    "story": "张浩四十出头，曾是一家机械厂的工人。工厂倒闭后，他靠零工维持生活。虽然日子拮据，但他仍保持对生活的韧劲。他喜欢在餐馆里坐在靠窗的位置，点上一碗热汤和几个小菜，边吃边看着街道上的人流。张浩常常回忆年轻时的意气风发，也会担忧孩子的未来。他知道自己没多少选择，但依然相信努力还能带来转机。餐馆的烟火气，是他心中残存的温暖记忆。",
    "story_eng": "Zhang Hao is in his early forties and used to be a worker at a machinery factory. After the factory closed down, he makes a living by taking on odd jobs. Although life is hard, he maintains his resilience. He likes to sit by the window in restaurants, order a bowl of hot soup and a few side dishes, and watch the flow of people on the street while eating. Zhang often recalls the high spirits of his youth and also worries about his child's future. He knows he doesn't have many choices, but he still believes that hard work can bring a turnaround. The lively atmosphere of the restaurant is a remnant of warm memories in his heart.",
    "returnIndex": 0,
    "favDishes": [ "红烧肉", "凉拌木耳" ]
  },
  {
    "name": "李婉婷",
    "name_eng": "Li Wanting",
    "baseMood": 78,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "李婉婷是一名小学音乐老师，性格温柔，笑容甜美。她喜欢在课堂上弹钢琴，带着孩子们唱歌。下班后，她常常到餐馆吃些清淡的菜，顺便整理教学计划。她热爱生活，喜欢旅行和拍照，朋友圈里充满了阳光和笑声。她偶尔也会孤单，但很快就能调整心态。餐馆对她来说，不只是吃饭的地方，更是她安静思考、寻找灵感的小角落。",
    "story_eng": "Li Wanting is a primary school music teacher with a gentle personality and a sweet smile. She enjoys playing the piano in class and leading the children in singing. After work, she often goes to restaurants to eat light dishes while organizing her lesson plans. She loves life, enjoys traveling and taking photos, and her social media is full of sunshine and laughter. She occasionally feels lonely, but she can quickly adjust her mindset. For her, the restaurant is not just a place to eat, but also a small corner where she can think quietly and seek inspiration.",
    "returnIndex": 0,
    "favDishes": [ "清炒时蔬", "西红柿炒鸡蛋" ]
  },
  {
    "name": "周志伟",
    "name_eng": "Zhou Zhiwei",
    "baseMood": 59,
    "personalityType": "中性",
    "personalityType_eng": "neutral",
    "story": "周志伟是一名出租车司机，三十多岁，性格爽朗。他每天穿梭在城市的大街小巷，听到过形形色色的故事。生活让他疲惫，但也让他更加乐观。他喜欢在餐馆里点一份家常菜，吃饱后继续拉客。他常常和店里的熟人聊几句，缓解一天的孤独。他年轻时喜欢旅行，但随着家庭和生活的压力，这个梦想被搁置。餐馆的饭菜，是他补充能量的最好方式。",
    "story_eng": "Zhou Zhiwei is a taxi driver in his thirties with a cheerful personality. He shuttles through the streets and alleys of the city every day, hearing all kinds of stories. Life makes him tired, but it also makes him more optimistic. He likes to order a home-style dish in restaurants, eat his fill, and then continue picking up passengers. He often chats with familiar faces in the restaurant to alleviate the loneliness of the day. He loved traveling when he was young, but this dream was set aside due to family and life pressures. The food from the restaurant is the best way for him to replenish his energy.",
    "returnIndex": 0,
    "favDishes": [ "鱼香肉丝", "酸辣土豆丝" ]
  },
  {
    "name": "赵子涵",
    "name_eng": "Zhao Zihan",
    "baseMood": 72,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "赵子涵是一位年轻的白领，刚进入一家广告公司工作。她性格开朗，喜欢与同事分享生活中的小确幸。虽然工作压力大，但她总能用笑容面对。她注重养生，饮食偏清淡，常常选择蔬菜类菜肴。她喜欢在餐馆里和朋友聊天，谈理想与未来。她梦想着有一天能开一家属于自己的设计工作室。餐馆对她来说，是休息和社交的好去处，让她在忙碌的工作中找到平衡。",
    "story_eng": "Zhao Zihan is a young white-collar worker who just started at an advertising company. She has an outgoing personality and likes to share life's small joys with her colleagues. Although work is stressful, she always faces it with a smile. She focuses on wellness, prefers a light diet, and often chooses vegetable dishes. She enjoys chatting with friends in restaurants, talking about ideals and the future. She dreams of one day opening her own design studio. For her, the restaurant is a great place to rest and socialize, helping her find balance in her busy work life.",
    "returnIndex": 0,
    "favDishes": [ "蒜蓉西兰花", "蚝油生菜" ]
  },
  {
    "name": "陈建国",
    "name_eng": "Chen Jianguo",
    "baseMood": 33,
    "personalityType": "消极",
    "personalityType_eng": "negative",
    "story": "陈建国五十岁出头，曾是一名工地包工头。因为项目失败，他欠下债务，生活陷入困境。他性格暴躁，常因小事发火，对服务态度极其敏感。一旦菜上得慢或不合口味，他就会抱怨甚至拍桌子。他嘴上强硬，但心里其实很自卑，觉得人生已经走下坡路。餐馆对他来说，既是排遣烦恼的地方，也是他情绪爆发的出口。服务员若处理不当，很容易与他发生冲突。",
    "story_eng": "Chen Jianguo is in his early fifties and was a construction site contractor. Due to a failed project, he is in debt and his life is in trouble. He has a fiery temper, often gets angry over small things, and is extremely sensitive to service attitude. If the food is slow or not to his taste, he will complain or even slam the table. He talks tough, but deep down he is actually very insecure, feeling that his life is on the decline. For him, the restaurant is both a place to vent his frustrations and an outlet for his emotions. If the waitstaff doesn't handle him properly, it's easy to get into a conflict with him.",
    "returnIndex": 0,
    "favDishes": [ "回锅肉", "椒盐排骨" ]
  },
  {
    "name": "王敏",
    "name_eng": "Wang Min",
    "baseMood": 84,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "王敏新婚不久，和丈夫感情甜蜜。她性格开朗，喜欢探索不同的餐馆，把吃饭当作生活的小冒险。她爱拍照，常常把餐桌上的美食晒到朋友圈。她梦想着有一天开一家小餐馆，把幸福的味道分享给更多人。对她来说，餐桌上的欢笑就是生活中最珍贵的片段。她喜欢热闹的氛围，也喜欢和朋友们一起畅谈未来。餐馆的灯光与香气，让她觉得生活充满希望。",
    "story_eng": "Wang Min is newly married and has a sweet relationship with her husband. She is outgoing and enjoys exploring different restaurants, treating dining as a small adventure in life. She loves taking photos and often shares pictures of delicious food from the table on social media. She dreams of one day opening a small restaurant to share the taste of happiness with more people. For her, the laughter around the dining table is the most precious fragment of life. She enjoys a lively atmosphere and also loves chatting about the future with friends. The lights and aroma of the restaurant make her feel that life is full of hope.",
    "returnIndex": 0,
    "favDishes": [ "宫保鸡丁", "糖醋排骨" ]
  },
  {
    "name": "刘浩然",
    "name_eng": "Liu Haoran",
    "baseMood": 51,
    "personalityType": "中性",
    "personalityType_eng": "neutral",
    "story": "刘浩然是一名刚毕业的大学生，独自一人在外地打拼。他在一家小公司工作，收入微薄，生活拮据。他常常在餐馆点一些简单的菜，偶尔奢侈一把，寻找家的味道。他渴望成功，但也常常感到迷茫。他喜欢观察周围的人，把他们的故事当作自己前行的动力。他相信只要坚持，总有一天能闯出一片天地。餐馆的烟火气，是他心中最温暖的慰藉。",
    "story_eng": "Liu Haoran is a recent university graduate, struggling alone in a foreign city. He works in a small company with a meager income and a tight life. He often orders simple dishes at restaurants, occasionally splurging to find the taste of home. He longs for success but also often feels lost. He likes to observe the people around him, using their stories as motivation to move forward. He believes that as long as he perseveres, he will eventually make a name for himself someday. The bustling atmosphere of the restaurant is the warmest comfort in his heart.",
    "returnIndex": 0,
    "favDishes": [ "红烧茄子", "京酱肉丝" ]
  },
  {
    "name": "孙倩",
    "name_eng": "Sun Qian",
    "baseMood": 66,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "孙倩是一名护士，工作节奏快，常常连轴转。她虽然很累，但依旧乐观，喜欢在下班后到餐馆点几道热菜，犒劳自己。她性格温柔，习惯照顾别人，也希望有人能在她疲惫时关心她。她梦想着有一天能去远方旅行，看看大海和星空。餐馆的烟火气让她觉得安心，也让她在紧张的生活中找到一丝自由。对她来说，美食是最最简单的幸福。",
    "story_eng": "Sun Qian is a nurse with a fast-paced work rhythm, often working long shifts consecutively. Although she is very tired, she remains optimistic and likes to order a few hot dishes at a restaurant after work to reward herself. She has a gentle personality, is accustomed to taking care of others, and also hopes someone will care for her when she is tired. She dreams of traveling to faraway places one day to see the ocean and the starry sky. The lively atmosphere of the restaurant makes her feel at ease and also helps her find a trace of freedom in her tense life. For her, delicious food is the simplest happiness.",
    "returnIndex": 0,
    "favDishes": [ "酸辣土豆丝", "西红柿炒鸡蛋" ]
  },
  {
    "name": "何军",
    "name_eng": "He Jun",
    "baseMood": 39,
    "personalityType": "消极",
    "personalityType_eng": "negative",
    "story": "何军是一名中年男子，经历过失败的婚姻，心中常带怨气。他习惯一个人生活，也习惯了沉默。他常常在餐馆独自吃饭，不在乎点什么，只是为了有人气的环境。他容易因为别人说话的语气或眼神而误解，觉得自己被忽视。他偶尔会想起年轻时的梦想和激情，但转念一想，那些早已远去。他的世界简单又孤僻，餐馆里人来人往，他却始终是一个冷眼旁观的影子。",
    "story_eng": "He Jun is a middle-aged man who has experienced a failed marriage and often carries resentment in his heart. He is accustomed to living alone and to silence. He often eats alone in restaurants, not caring what he orders, just for the environment with some human presence. He easily misinterprets others' tones of voice or glances, feeling that he is being ignored. He occasionally thinks back to the dreams and passions of his youth, but then reflects that those are long gone. His world is simple and reclusive; although people come and go in the restaurant, he remains a shadow observing coldly from the sidelines.",
    "returnIndex": 0,
    "favDishes": []
  },
  {
    "name": "林芳",
    "name_eng": "Lin Fang",
    "baseMood": 76,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "林芳是一位花店老板娘，性格温柔，喜欢和花草打交道。她每天清晨都会去花市挑选最新鲜的花材。她热爱生活，喜欢把花与美食联系在一起，认为那是生活的浪漫。她常常到餐馆点一些清淡的菜，细细品味平凡的滋味。她喜欢和朋友分享生活中的小确幸，也喜欢用花束表达心情。她梦想有一天开一家花艺餐厅，让顾客在花香与美味中感受温暖。",
    "story_eng": "Lin Fang is a flower shop owner with a gentle personality who enjoys working with flowers and plants. Every morning she goes to the flower market to pick the freshest flowers. She loves life and likes to connect flowers with food, believing it to be the romance of life. She often goes to restaurants to order some light dishes, savoring the taste of the ordinary. She enjoys sharing life's small joys with friends and also likes to express her feelings through bouquets. She dreams of one day opening a floral-themed restaurant where customers can feel warmth amidst the scent of flowers and delicious food.",
    "returnIndex": 0,
    "favDishes": [ "清炒时蔬", "铁板豆腐" ]
  },
  {
    "name": "郭鹏",
    "name_eng": "Guo Peng",
    "baseMood": 57,
    "personalityType": "中性",
    "personalityType_eng": "neutral",
    "story": "郭鹏是一名小企业主，平时忙于经营一家五金店。他性格外向，善于交际，常常请客户在餐馆吃饭，通过饭桌建立关系。他的生活看似风光，但背后也背负着资金和竞争的压力。餐馆对他来说是工作的一部分，也是短暂放松的港湾。他喜欢点一些硬菜，既是待客之道，也是慰劳自己。偶尔他也会独自小酌，思考未来的路该怎么走。",
    "story_eng": "Guo Peng is a small business owner, usually busy running a hardware store. He is outgoing, sociable, and often invites clients to eat at restaurants to build relationships over meals. His life may seem glamorous, but behind it, he also bears the pressure of finances and competition. The restaurant is part of his work and also a haven for brief relaxation. He likes to order some substantial dishes, both as a way to entertain guests and to reward himself. Occasionally, he also drinks alone, thinking about which path to take in the future.",
    "returnIndex": 0,
    "favDishes": [ "水煮牛肉", "东坡肉" ]
  },
  {
    "name": "徐媛",
    "name_eng": "Xu Yuan",
    "baseMood": 68,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "徐媛是一名小学老师，性格温和，喜欢和孩子们相处。她常常带作业到餐馆批改，觉得在烟火气中工作更高效。她喜欢安静的角落，一边吃饭一边看书。生活中，她热心助人，也常常为学生家长分忧。她偶尔会怀念童年的单纯时光，想把那份温暖带给学生。餐馆对她来说是一种放松，一个能让她暂时忘掉工作压力的地方。",
    "story_eng": "Xu Yuan is a primary school teacher with a mild temperament who enjoys being with children. She often brings homework to restaurants to grade, feeling that she works more efficiently in the lively atmosphere. She prefers quiet corners where she can read a book while eating. In life, she is warm-hearted and helpful, often sharing the concerns of her students' parents. She occasionally misses the simple times of childhood and wants to bring that warmth to her students. The restaurant is a form of relaxation for her, a place where she can temporarily forget the pressures of work.",
    "returnIndex": 0,
    "favDishes": [ "麻婆豆腐", "蒜蓉西兰花" ]
  },
  {
    "name": "韩磊",
    "name_eng": "Han Lei",
    "baseMood": 36,
    "personalityType": "消极",
    "personalityType_eng": "negative",
    "story": "韩磊是一名音乐人，年轻时怀揣梦想来到城市，但作品一直未被市场接受。他性格倔强，不愿放弃，却常常陷入低落。为了寻找灵感，他会在餐馆点些辣味的菜，让刺激的味道唤起创作热情。他脾气急躁，只要环境吵闹或菜品不合心意，就会抱怨。虽然困境让他焦虑，但他坚信有一天自己的作品能被听见。餐馆的喧嚣与安静交织，对他而言既是灵感来源，也是发泄不满的出口。",
    "story_eng": "Han Lei is a musician who came to the city with dreams when he was young, but his work has never been accepted by the market. He is stubborn and unwilling to give up, yet often falls into low spirits. To seek inspiration, he orders spicy dishes at restaurants, hoping the stimulating flavor will ignite his creative passion. He has a quick temper and will complain if the environment is noisy or the food doesn't suit his taste. Although his predicament makes him anxious, he firmly believes that one day his work will be heard. The interweaving of noise and quiet in the restaurant is both a source of inspiration and an outlet for his dissatisfaction.",
    "returnIndex": 0,
    "favDishes": [ "酸菜鱼", "口水鸡" ]
  },
  {
    "name": "吴婷",
    "name_eng": "Wu Ting",
    "baseMood": 91,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "吴婷是一位旅行博主，年轻开朗，喜欢记录生活点滴。她常常带相机走进餐馆，把每一道菜拍得精致漂亮，再写下自己的感受。她对新鲜事物充满热情，喜欢尝试各种菜肴。她的粉丝们期待她的美食推荐。虽然旅途奔波，但她从不觉得累，因为她享受分享的过程。餐馆对她来说，不只是吃饭的地方，也是她创作灵感的来源。她相信，人生就该不断体验，才能找到真正的乐趣。",
    "story_eng": "Wu Ting is a travel blogger, young and cheerful, who enjoys recording bits of life. She often brings her camera into restaurants, takes exquisite photos of every dish, and then writes down her feelings. She is full of enthusiasm for new things and loves to try various cuisines. Her fans look forward to her food recommendations. Although the journey is hectic, she never feels tired because she enjoys the process of sharing. For her, the restaurant is not just a place to eat, but also a source of creative inspiration. She believes that life should be about constant experience to find true joy.",
    "returnIndex": 0,
    "favDishes": [ "糖醋里脊", "蒜蓉西兰花" ]
  },
  {
    "name": "马勇",
    "name_eng": "Ma Yong",
    "baseMood": 58,
    "personalityType": "中性",
    "personalityType_eng": "neutral",
    "story": "马勇是一名快递员，每天风里来雨里去，奔波在城市的大街小巷。他性格憨厚，做事干脆利落，但长期的劳累让他身体常常感到疲惫。他喜欢在餐馆里点一些分量足的菜，觉得吃饱才有力气继续送件。偶尔他会和同行聚在一起，边吃边聊，分享一天的见闻。虽然收入不高，但他很珍惜这份工作，因为能让家里生活稳定。餐馆对他来说，是加油站，也是他在繁忙生活中难得的休息点。",
    "story_eng": "Ma Yong is a courier who braves the wind and rain every day, rushing through the streets and alleys of the city. He has a simple and honest personality, does things neatly and efficiently, but long-term fatigue often makes his body feel tired. He likes to order substantial dishes in restaurants, feeling that only when full does he have the strength to continue delivering packages. Occasionally, he gathers with colleagues in the same line of work to eat, chat, and share the day's experiences. Although his income is not high, he cherishes this job because it allows his family to have a stable life. For him, the restaurant is a gas station and also a rare resting point in his busy life.",
    "returnIndex": 0,
    "favDishes": [ "回锅肉", "小炒黄牛肉" ]
  },
  {
    "name": "沈洁",
    "name_eng": "Shen Jie",
    "baseMood": 73,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "沈洁是一名设计师，性格安静，喜欢独处。她的工作充满创意，也伴随着高压。她喜欢在餐馆点一些色彩鲜艳的菜，觉得那种搭配让她在视觉和味觉上都得到满足。她常常带着速写本，一边吃饭一边画草图，把灵感记录下来。她很少和别人过多交流，但在笔下，她能自由表达自己。餐馆对她来说，是灵感的来源，也是她放松的角落。",
    "story_eng": "Shen Jie is a designer with a quiet personality who enjoys solitude. Her work is full of creativity but also comes with high pressure. She likes to order colorful dishes in restaurants, feeling that the combination satisfies her both visually and gustatorily. She often brings a sketchbook, drawing sketches while eating to record her inspiration. She rarely communicates much with others, but through her pen, she can express herself freely. For her, the restaurant is a source of inspiration and also a corner for relaxation.",
    "returnIndex": 0,
    "favDishes": [ "鱼香茄子", "凉拌木耳" ]
  },
  {
    "name": "杨飞",
    "name_eng": "Yang Fei",
    "baseMood": 42,
    "personalityType": "消极",
    "personalityType_eng": "negative",
    "story": "杨飞是一名工厂流水线工人，每天重复单调的动作。他渐渐对生活失去了激情。下班后，他常常和朋友去餐馆喝酒聊天，借此从疲惫的工作中抽离。他容易借酒撒气，尤其在喝多时会和服务员争论，甚至因为小事动怒。他内心其实渴望改变，但缺乏勇气和机会。餐馆的热闹让他觉得自己还算有个去处，但他身上的戾气也让人难以亲近。",
    "story_eng": "Yang Fei is a factory assembly line worker who repeats monotonous movements every day. He has gradually lost his passion for life. After work, he often goes to restaurants with friends to drink and chat, using this to detach from his exhausting job. He tends to vent his anger through alcohol, especially when drunk, he might argue with waitstaff or even get angry over small matters. Deep down, he actually longs for change but lacks the courage and opportunity. The liveliness of the restaurant makes him feel he still has a place to go, but the hostility he carries also makes it difficult for others to get close to him.",
    "returnIndex": 0,
    "favDishes": [ "蒜泥白肉", "凉拌木耳" ]
  },
  {
    "name": "唐雪",
    "name_eng": "Tang Xue",
    "baseMood": 77,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "唐雪是一位年轻母亲，常常带孩子来餐馆吃饭。她注重营养搭配，总是点一些适合全家分享的菜。她喜欢把孩子的成长记录下来，偶尔会在朋友圈晒家庭聚餐的照片。她的丈夫工作繁忙，餐馆成了她与孩子之间的亲密时光。她认为食物不仅是味觉享受，更是家庭情感的纽带。餐馆的热闹氛围让她觉得安心，也让她在琐碎的生活中找到属于自己的幸福。",
    "story_eng": "Tang Xue is a young mother who often brings her child to eat at restaurants. She pays attention to nutritional balance and always orders dishes suitable for the whole family to share. She likes to record her child's growth and occasionally posts photos of family meals on social media. Her husband is busy with work, so the restaurant has become intimate time for her and her child. She believes that food is not only a gustatory enjoyment but also a bond of family emotions. The bustling atmosphere of the restaurant makes her feel at ease and also helps her find her own happiness in the trivialities of life.",
    "returnIndex": 0,
    "favDishes": [ "清蒸鲈鱼", "清炒时蔬" ]
  },
  {
    "name": "高峰",
    "name_eng": "Gao Feng",
    "baseMood": 65,
    "personalityType": "中性",
    "personalityType_eng": "neutral",
    "story": "高峰是一名体育教练，身体健壮，性格直爽。他的生活节奏紧凑，常年在训练场上指导学生。饮食上，他注重蛋白质和能量的摄入，喜欢简单实在的家常菜。餐馆对他来说是补充体力的地方，也是和学生们聚餐交流的场所。他喜欢和年轻人聊运动和生活，觉得那让他保持年轻心态。虽然训练辛苦，但他热爱这份工作，因为能见证学生们的成长。",
    "story_eng": "Gao Feng is a sports coach with a strong physique and a straightforward personality. His life style is tight, coaching students on the training field year-round. In terms of diet, he focuses on protein and energy intake and prefers simple, substantial home-style dishes. The restaurant is a place for him to replenish his strength and also a venue to gather and communicate with his students. He enjoys talking about sports and life with young people, feeling that it keeps him young at heart. Although training is hard work, he loves his job because he gets to witness his students' growth.",
    "returnIndex": 0,
    "favDishes": [ "小炒黄牛肉", "铁板豆腐" ]
  },
  {
    "name": "段玲",
    "name_eng": "Duan Ling",
    "baseMood": 50,
    "personalityType": "中性",
    "personalityType_eng": "neutral",
    "story": "段玲是一名图书管理员，安静内向，喜欢独处。她的日常被书香环绕，工作虽然枯燥，但让她觉得安心。她常常在餐馆找一个角落，慢慢品尝食物，更享受一个人安静的时光。她不在意吃什么菜，只要环境舒适就好。生活中，她喜欢写日记，把心情记录下来。虽然朋友不多，但她并不觉得孤单，因为书本和文字就是她最好的伴侣。餐馆的烟火气，让她偶尔有一种回到现实的踏实感。",
    "story_eng": "Duan Ling is a librarian, quiet and introverted, who enjoys being alone. Her daily life is surrounded by the scent of books; although the work is monotonous, it makes her feel secure. She often finds a corner in a restaurant to slowly savor her food, enjoying the quiet time alone even more. She doesn't care much about what she eats, as long as the environment is comfortable. In life, she likes to keep a diary, recording her moods. Although she doesn't have many friends, she doesn't feel lonely because books and words are her best companions. The lively atmosphere of the restaurant occasionally gives her a sense of grounding and returning to reality.",
    "returnIndex": 0,
    "favDishes": []
  },
  {
    "name": "侯杰",
    "name_eng": "Hou Jie",
    "baseMood": 37,
    "personalityType": "消极",
    "personalityType_eng": "negative",
    "story": "侯杰是一位赌徒，常因输钱而身无分文。他的生活不稳定，情绪低落。偶尔他会走进餐馆，点一些便宜的小菜，只为填饱肚子。他心中焦躁，却又无法自拔。他脾气急躁，经常把自己的不满迁怒于服务员，一旦觉得菜价高或分量少，就会大声嚷嚷。他年轻时也有梦想，但渐渐被赌博摧毁。餐馆对他来说，是暂时逃避现实的地方，却也是冲突频发的场所。",
    "story_eng": "Hou Jie is a gambler, often penniless due to losing money. His life is unstable and his mood is low. Occasionally, he walks into a restaurant to order some cheap small dishes, just to fill his stomach. He feels anxious inside but cannot extricate himself. He has a quick temper and often takes out his dissatisfaction on the waitstaff, loudly complaining if he thinks the price is too high or the portion is too small. He also had dreams when he was young, but they were gradually destroyed by gambling. For him, the restaurant is a place to temporarily escape reality, but it is also a place where conflicts frequently occur.",
    "returnIndex": 0,
    "favDishes": [ "凉拌木耳" ]
  },
  {
    "name": "丁媛",
    "name_eng": "Ding Yuan",
    "baseMood": 83,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "丁媛是一名舞蹈老师，性格开朗，自信大方。她喜欢把生活过得充满节奏感，就像跳舞一样。她常常和朋友聚在餐馆里，点几道菜，边吃边聊，畅谈生活和梦想。她热爱舞台，也热爱生活，觉得美食和舞蹈一样，都是表达情感的方式。她喜欢尝试重口味的菜，觉得那种刺激让她像在跳一支热舞。餐馆的热闹氛围，让她觉得自己永远年轻。",
    "story_eng": "Ding Yuan is a dance teacher with an outgoing personality, confident and generous. She likes to live her life with a sense of rhythm, just like dancing. She often gathers with friends in restaurants, orders a few dishes, chats while eating, and talks freely about life and dreams. She loves the stage and also loves life, feeling that good food, like dance, is a way to express emotions. She enjoys trying strongly flavored dishes, feeling that the stimulation is like dancing a hot number. The lively atmosphere of the restaurant makes her feel forever young.",
    "returnIndex": 0,
    "favDishes": [ "干锅牛蛙", "口水鸡" ]
  },
  {
    "name": "蒋涛",
    "name_eng": "Jiang Tao",
    "baseMood": 47,
    "personalityType": "消极",
    "personalityType_eng": "negative",
    "story": "蒋涛是一名出租屋房东，性格孤僻，不喜欢与人打交道。他生活简单，收入稳定，却鲜少和别人来往。他经常独自到餐馆吃饭，点一些简单的菜，不与人交流，吃完就走。他对服务员的态度冷淡，偶尔还会因为小事抱怨。他喜欢在餐馆里观察别人，却从不主动参与。他偶尔会想起年轻时的热闹时光，但现在更享受安静。餐馆对他来说，是填饱肚子的地方，也是发泄孤僻情绪的出口。",
    "story_eng": "Jiang Tao is a rental property landlord with a reclusive personality who dislikes dealing with people. He leads a simple life with a stable income but rarely interacts with others. He often eats alone in restaurants, orders simple dishes, does not communicate with anyone, and leaves after eating. His attitude towards waitstaff is cold, and he occasionally complains about small things. He likes to observe others in the restaurant but never initiates participation. He occasionally recalls the lively times of his youth but now enjoys quiet more. For him, the restaurant is a place to fill his stomach and also an outlet for his reclusive emotions.",
    "returnIndex": 0,
    "favDishes": []
  },
  {
    "name": "蔡琳",
    "name_eng": "Cai Lin",
    "baseMood": 77,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "蔡琳是一位广告策划，脑子里总是充满创意。她性格活跃，喜欢在餐桌上寻找灵感，认为一道菜的摆盘都可能给她启发。她常常带同事来餐馆聚餐，把工作和生活结合在一起。虽然工作压力大，但她总能用幽默的方式化解。她喜欢尝试不同的菜肴，尤其对颜色鲜艳或造型独特的菜特别感兴趣。餐馆对她来说，不仅是吃饭的地方，更是灵感的源泉和社交的舞台。",
    "story_eng": "Cai Lin is an advertising planner, her mind always full of creativity. She has an active personality and enjoys seeking inspiration at the dining table, believing that even the plating of a dish can inspire her. She often brings colleagues to restaurants for meals, combining work and life. Although work is stressful, she always manages to resolve it with humor. She loves to try different cuisines, especially those with bright colors or unique presentations. For her, the restaurant is not just a place to eat, but also a source of inspiration and a stage for socializing.",
    "returnIndex": 0,
    "favDishes": [ "宫保鸡丁", "凉拌木耳" ]
  },
  {
    "name": "谢明",
    "name_eng": "Xie Ming",
    "baseMood": 53,
    "personalityType": "中性",
    "personalityType_eng": "neutral",
    "story": "谢明是一名出租车调度员，长期坐在办公室里，性格有些急躁。他饮食上喜欢油腻重口味的菜，觉得那样才过瘾。虽然工作不算辛苦，但精神上常常紧绷。他喜欢下班后到餐馆点几道硬菜，配上白米饭，觉得那才是真正的放松。他偶尔会因为上菜慢而抱怨，但总体还是克制的。餐馆对他来说，是一个让人卸下工作的地方，哪怕只是短暂的时光，也能让他觉得生活还有滋味。",
    "story_eng": "Xie Ming is a taxi dispatcher who sits in the office for long hours and has a somewhat impatient personality. In terms of diet, he prefers oily and strongly flavored dishes, feeling that only then is it satisfying. Although his job isn't particularly hard, he is often mentally tense. He likes to go to a restaurant after work, order a few substantial dishes with white rice, feeling that is true relaxation. He occasionally complains if the food is slow, but overall he remains restrained. For him, the restaurant is a place to shed the weight of work; even if just for a short time, it can make him feel that life still has flavor.",
    "returnIndex": 0,
    "favDishes": [ "红烧肉", "回锅肉" ]
  },
  {
    "name": "黄蕾",
    "name_eng": "Huang Lei",
    "baseMood": 88,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "黄蕾是一位插画师，天性浪漫，喜欢用画笔记录生活的细节。她常常带着速写本在餐馆画下有趣的场景，把顾客的神态和菜肴的色彩融入作品中。她喜欢在餐馆观察人群，觉得每个人都有故事。她的作品带着温暖，受到很多人喜欢。对她来说，美食和画画一样，都是表达情感的方式。餐馆的喧嚣与温馨氛围，让她觉得灵感源源不断，也是她创作的重要一部分。",
    "story_eng": "Huang Lei is an illustrator by nature romantic, who enjoys using her brush to record the details of life. She often brings a sketchbook to restaurants to draw interesting scenes, incorporating the expressions of customers and the colors of dishes into her work. She enjoys observing the crowd in restaurants, feeling that everyone has a story. Her works carry warmth and are loved by many. For her, good food, like drawing, is a way to express emotions. The noisy yet warm atmosphere of the restaurant makes her feel a constant flow of inspiration and is an important part of her creative process.",
    "returnIndex": 0,
    "favDishes": [ "清炒时蔬", "西红柿炒鸡蛋" ]
  },
  {
    "name": "卢刚",
    "name_eng": "Lu Gang",
    "baseMood": 41,
    "personalityType": "中性",
    "personalityType_eng": "neutral",
    "story": "卢刚是一名卡车司机，常年奔波在全国各地。他的生活节奏快，吃饭只求快，不挑剔菜肴。只要能迅速填饱肚子，他就能继续上路。他的身体早已习惯了这种生活，但心里偶尔也会羡慕别人能安稳过日子。他喜欢在餐馆随便点点，吃完就走，很少和别人交流。对他来说，餐馆只是补充体力的地方，却也偶尔能让他感受到一丝人情味。他的人生就像车轮一样，永远在路上。",
    "story_eng": "Lu Gang is a truck driver who travels across the country year-round. His life pace is fast; when eating, he only seeks speed and is not picky about dishes. As long as he can quickly fill his stomach, he can continue on the road. His body has long been accustomed to this life, but in his heart, he occasionally envies others who can live a stable life. He likes to order randomly in restaurants, eat, and leave, rarely communicating with others. For him, the restaurant is just a place to replenish his energy, but it can also occasionally let him feel a trace of human warmth. His life is like a wheel, always on the road.",
    "returnIndex": 0,
    "favDishes": []
  },
  {
    "name": "邹雯",
    "name_eng": "Zou Wen",
    "baseMood": 71,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "邹雯是一名研究生，喜欢在用餐时看书。她性格安静，喜欢思考，常常点一些清淡的菜肴，边吃边整理笔记。她的生活以学习为主，很少有娱乐活动。虽然看起来单调，但她觉得很充实。她偶尔会和同学聚餐，聊一些学术话题。餐馆对她来说，是一个既能吃饭又能思考的地方。她喜欢那种在热闹中保持安静的感觉，觉得这让她更有安全感。她的人生目标是成为一名大学讲师。",
    "story_eng": "Zou Wen is a graduate student who enjoys reading books during meals. She has a quiet personality, likes to think, and often orders light dishes while organizing her notes as she eats. Her life is mainly focused on studying, with very few entertainment activities. Although it may seem monotonous, she finds it very fulfilling. She occasionally dines with classmates to discuss academic topics. For her, the restaurant is a place where she can both eat and think. She likes the feeling of maintaining quiet amidst the bustle, feeling that it gives her a greater sense of security. Her life goal is to become a university lecturer.",
    "returnIndex": 0,
    "favDishes": [ "清炒时蔬", "铁板豆腐" ]
  },
  {
    "name": "崔健",
    "name_eng": "Cui Jian",
    "baseMood": 64,
    "personalityType": "中性",
    "personalityType_eng": "neutral",
    "story": "崔健是一名警察，工作强度大，但内心坚定。他常常加班，生活节奏紧张。为了犒劳自己，他喜欢在餐馆点一些硬菜，觉得这样才对得起自己的辛苦。他性格正直，做事果断，生活中也带着一丝严肃。虽然工作占据了大部分时间，但他依旧乐观，喜欢在闲暇时和同事聚餐。餐馆对他来说，是放松的地方，也是和战友们增进感情的场所。每一顿饭，都是他辛勤工作的最好奖励。",
    "story_eng": "Cui Jian is a policeman with a high-intensity job, but he is firm inside. He often works overtime, and his life pace is tense. To reward himself, he likes to order some substantial dishes in restaurants, feeling that this is worthy of his hard work. He has an upright personality, acts decisively, and carries a hint of seriousness in life. Although work occupies most of his time, he remains optimistic and enjoys gathering for meals with colleagues in his leisure time. For him, the restaurant is a place to relax and also a venue to strengthen bonds with his comrades. Every meal is the best reward for his hard work.",
    "returnIndex": 0,
    "favDishes": [ "水煮牛肉", "葱爆羊肉" ]
  },
  {
    "name": "范晓东",
    "name_eng": "Fan Xiaodong",
    "baseMood": 62,
    "personalityType": "积极",
    "personalityType_eng": "positive",
    "story": "范晓东三十五岁，是一名中学体育老师。他性格开朗，喜欢和学生一起打篮球，深受孩子们的喜爱。虽然工作稳定，但他对未来依旧有自己的规划，希望能够考取更高的教练资格证。平日里，他喜欢在餐馆点几道清爽的菜，既能补充能量，又不会过于油腻。他偶尔也会和同事小聚，聊教育和生活琐事。餐馆对他来说，是放松心情、与朋友交流的地方，也是一种生活的仪式感。",
    "story_eng": "Fan Xiaodong is thirty-five years old and a middle school physical education teacher. He has an outgoing personality, enjoys playing basketball with students, and is deeply loved by the children. Although his job is stable, he still has his own plans for the future, hoping to obtain a higher coaching qualification certificate. On ordinary days, he likes to order a few light and refreshing dishes in restaurants, which can replenish energy without being too greasy. He also occasionally gathers with colleagues to chat about education and life's trivialities. For him, the restaurant is a place to relax, communicate with friends, and also a sense of ritual in life.",
    "returnIndex": 0,
    "favDishes": [ "蒜蓉西兰花", "宫保鸡丁" ]
  }
]