[
  {
    "name": "周立",
    "Energy": 73,
    "Mood": 28,
    "personalityType": "negative",
    "story": "周立以前是个推销员，但因业绩一直不佳频繁被辞退。他对自己已经彻底失去信心，转而在餐厅打工只是为了糊口。他做事机械，几乎不和顾客寒暄，态度冷淡，甚至带点不耐烦。他讨厌被人指挥，却又没有勇气改变现状。他常自言自语，觉得生活像是无尽的牢笼。"
  },
  {
    "name": "钱志文",
    "Energy": 64,
    "Mood": 32,
    "personalityType": "negative",
    "story": "钱志文年轻时赌性很重，欠下债务，把朋友和家人都得罪光了。现在他在餐厅做服务员，还债的压力让他长期处于焦躁中。他对顾客表面客气，实际上常翻白眼或在心里抱怨。每当看到口袋鼓鼓的客人，他都会暗暗羡慕并生出怨气。他觉得自己是不折不扣的失败者。"
  },
  {
    "name": "张倩",
    "Energy": 69,
    "Mood": 30,
    "personalityType": "negative",
    "story": "张倩是一位被现实打击过的离异女性，她对生活几乎失去了热情。她选择在餐厅工作纯粹因为不用动脑，收入勉强维持温饱。顾客的笑声在她看来常常刺耳，她会下意识板着脸，给人冷漠的感觉。她并不是坏人，只是心早已麻木，对未来不抱任何希望。"
  },
  {
    "name": "黄磊",
    "Energy": 77,
    "Mood": 25,
    "personalityType": "negative",
    "story": "黄磊在大学时梦想过写小说，但连续几年被拒稿让他彻底绝望。他在餐厅打工时常神情恍惚，动作迟缓，态度冷淡。他很容易因为顾客一句小小的质疑而烦躁，甚至直接顶嘴。他觉得自己的青春被浪费了，现在只剩下无趣的日子。他常想躲起来，不愿面对人群。"
  },
  {
    "name": "秦胜",
    "Energy": 60,
    "Mood": 33,
    "personalityType": "negative",
    "story": "秦胜本来在乡下有一块地，后来被征收后赔偿很少，他来到城市打工却始终找不到合适发展。做服务员只是无奈之举，他常对客人生气，觉得这些来消费的人过得都比自己好。他冷嘲热讽，甚至会故意拖延服务。他内心对社会有很深的怨气，看谁都不顺眼。"
  },
  {
    "name": "徐曼",
    "Energy": 74,
    "Mood": 31,
    "personalityType": "negative",
    "story": "徐曼从小家庭不和睦，成年后更是被多份工作辞退。她对人际关系充满不信任，哪怕是顾客的随意一句话，都容易被她误解为冒犯。她在工作中常常情绪低落，动作慢，爱发呆。她觉得餐厅的喧嚣让她更加烦躁，却不得不在其中谋生。她把所有笑容都锁在心底。"
  },
  {
    "name": "罗强",
    "Energy": 71,
    "Mood": 27,
    "personalityType": "negative",
    "story": "罗强年轻时因打架坐过牢，出狱后处处碰壁，只能找到服务员的工作。他性格暴躁易怒，常因小事对顾客摆脸色。他觉得自己被社会抛弃，难以改过自新。心底的不满经常影响他的态度。哪怕是同事的小提醒，他也会当成挑衅。餐厅对他来说只是苟且之地，毫无归属感。"
  },
  {
    "name": "戴华",
    "Energy": 66,
    "Mood": 29,
    "personalityType": "negative",
    "story": "戴华过去在外地做过流水线工人，习惯重复又枯燥的生活。如今在餐厅做服务员，他依旧对工作没有热情。他把顾客的要求都看作麻烦，心情差时甚至会直接无视。他很少和同事交流，更不会微笑。他觉得人际关系毫无意义，想的只是熬过今天再说。他的人生仿佛失去了颜色。"
  },
  {
    "name": "程丽",
    "Energy": 58,
    "Mood": 26,
    "personalityType": "negative",
    "story": "程丽年轻时想过当歌手，却因为家庭贫穷放弃了学业。她觉得命运总是在和自己作对，现在在餐厅工作成了勉强的谋生方式。她经常抱怨，不懂得掩饰自己的不满。顾客只要催单，她就会冷着脸，甚至自言自语说酸话。她已经习惯把怨气发泄在工作中，不在乎他人的感受。"
  },
  {
    "name": "傅成",
    "Energy": 62,
    "Mood": 21,
    "personalityType": "negative",
    "story": "傅成曾经欠债跑路，回来后只能在餐厅混口饭吃。他对任何人都没有信任，觉得别人都会利用他。他工作中勉强完成任务，但毫无热情。他态度阴沉，面对顾客时总是敷衍了事。他时常怀疑别人看不起自己，心里充满了愤懑。他觉得未来对他来说已经毫无意义。"
  }
]
