[
  {
    "name": "刘晨",
    "Energy": 93,
    "Mood": 85,
    "personalityType": "positive",
    "story": "刘晨热爱运动，从小就是学校里的运动健将。来到餐厅工作后，他把这份活儿视为新的挑战，总是充满干劲。他喜欢和顾客聊天，分享健康的小习惯，甚至会帮老人端菜时贴心提醒小心烫。他认为服务和比赛一样，都需要速度与耐心。他希望能用自己的热情感染同事和顾客，让大家在餐厅都带着笑容离开。"
  },
  {
    "name": "苏雅",
    "Energy": 88,
    "Mood": 79,
    "personalityType": "positive",
    "story": "苏雅是学前教育专业的毕业生，性格活泼开朗，笑声爽朗。她在餐厅工作时总是保持亲切的笑容，仿佛对每位客人都像照顾小朋友一样细心。她不仅能够快速记住常客的习惯，还喜欢对小朋友讲些轻松的笑话，让他们乖乖坐好。她觉得餐厅是个充满温暖的地方，也希望自己能成为别人一天中的一束小阳光。"
  },
  {
    "name": "楚天",
    "Energy": 95,
    "Mood": 87,
    "personalityType": "positive",
    "story": "楚天是退伍不久的军人，他带着军中习惯的果断和乐观进入餐厅工作。他总是精神抖擞，把每一次上菜当成一项任务完成得干净利落。同事们有困难，他一定第一个伸出援手。顾客对他印象最深的就是那句洪亮的“请慢用”。他认为人生就算平凡，也可以用笑容撑起属于自己的光彩。"
  },
  {
    "name": "林熙",
    "Energy": 90,
    "Mood": 81,
    "personalityType": "positive",
    "story": "林熙喜欢烘焙，梦想开一家甜品店。在餐厅做服务员是她学习与人相处的第一步。她常主动关心顾客，哪怕只是递上一杯温水都带着真诚的笑容。她会在顾客等待的时候与他们闲聊美食小技巧。她觉得人与人之间的交流就像甜点，加点耐心与真心，就能带来温暖的味道。"
  },
  {
    "name": "唐浩",
    "Energy": 86,
    "Mood": 75,
    "personalityType": "positive",
    "story": "唐浩以前是学校文艺社的主持人，擅长交际，口才了得。他在餐厅里总是尽力让服务变得轻松愉快，比如用幽默化解顾客的不耐烦。他习惯用“没问题，我来解决”来回应同事的请求。虽然这只是一份普通的工作，但他相信努力的态度能给每个人带来好心情。他希望未来能做一名活动策划人。"
  },
  {
    "name": "杨菲",
    "Energy": 92,
    "Mood": 82,
    "personalityType": "positive",
    "story": "杨菲一直热爱摄影，平日里喜欢用相机记录生活的美好瞬间。她在餐厅工作时，眼光总是明亮又专注，能迅速捕捉顾客需要帮助的细节。她耐心、温和，不管多忙都会保持礼貌和微笑。她觉得服务员就像生活中的小风景，能点缀别人的一天。她渴望未来开一场属于自己的摄影展，把温暖与美丽传递下去。"
  },
  {
    "name": "郭洋",
    "Energy": 89,
    "Mood": 83,
    "personalityType": "positive",
    "story": "郭洋是一个滑板爱好者，活力十足。他把端菜和跑堂当成一种运动，总是灵活穿梭在餐厅里。顾客常会被他的爽朗所感染，忍不住和他闲聊几句。他喜欢帮助同事打扫卫生，觉得团队合作才能让餐厅更舒适。他梦想以后开一家和运动结合的咖啡馆，希望顾客在那儿能体会到“充电”的快乐。"
  },
  {
    "name": "何莉",
    "Energy": 84,
    "Mood": 80,
    "personalityType": "positive",
    "story": "何莉是一名音乐爱好者，空闲时间常弹吉他。她在餐厅里，动作轻快，语气温柔，好像随时都带点节奏感。她特别善于安抚情绪不好的顾客，耐心听他们抱怨，然后用一两句轻松的话让对方放松。顾客们说，她就像一首背景音乐，让环境更柔和。她希望自己有一天能写出给大家带来力量的歌。"
  },
  {
    "name": "潘杰",
    "Energy": 91,
    "Mood": 79,
    "personalityType": "positive",
    "story": "潘杰是个爱开玩笑的大男孩，凡事都笑呵呵的。餐厅里再忙，他也会说上一句幽默的话，让同事忍不住笑。顾客对他印象也很好，觉得他不像服务员，更像老朋友。他相信笑声能化解一切不快，把再复杂的场合都变得轻松。他觉得每天的服务都是新的缘分，所以全力以赴对待每一次相遇。"
  },
  {
    "name": "赵婧",
    "Energy": 85,
    "Mood": 78,
    "personalityType": "positive",
    "story": "赵婧性格外向，喜欢旅行，常常把旅途中的见闻讲给顾客听，逗得大家开心。她对顾客的需求反应迅速，总是说“没问题，我马上来”。她觉得这份工作让她能认识许多不同的人，积累各种故事。虽然只是端盘子，但她把每一次微笑都当作一种分享。她希望几年后能带着积蓄再去环游世界。"
  }
]
